{ ... }:

{
  # Edit this to customize tte screensaver
  home.file.".local/share/logo.txt".text = ''
          ▗▄▄▄       ▗▄▄▄▄    ▄▄▄▖
          ▜███▙       ▜███▙  ▟███▛
           ▜███▙       ▜███▙▟███▛
            ▜███▙       ▜██████▛
     ▟█████████████████▙ ▜████▛     ▟▙
    ▟███████████████████▙ ▜███▙    ▟██▙
           ▄▄▄▄▖           ▜███▙  ▟███▛
          ▟███▛             ▜██▛ ▟███▛
         ▟███▛               ▜▛ ▟███▛
▟███████████▛                  ▟██████████▙
▜██████████▛                  ▟███████████▛
      ▟███▛ ▟▙               ▟███▛
     ▟███▛ ▟██▙             ▟███▛
    ▟███▛  ▜███▙           ▝▀▀▀▀
    ▜██▛    ▜███▙ ▜██████████████████▛
     ▜▛     ▟████▙ ▜████████████████▛
           ▟██████▙         ▜███▙
          ▟███▛▜███▙         ▜███▙
         ▟███▛  ▜███▙         ▜███▙
         ▝▀▀▀    ▀▀▀▀▘         ▀▀▀▘
  '';

  # This centers the logo
  home.file.".local/share/center_logo.py".text = ''
  import unicodedata, os

  def wcswidth(s):
      w = 0
      for c in s:
          e = unicodedata.east_asian_width(c)
          w += 2 if e in ('W', 'F') else 1
      return w

  cols = int(os.environ.get("COLS", 80))
  rows = int(os.environ.get("ROWS", 24))

  lines = open(os.path.expanduser("~/.local/share/logo.txt")).read().splitlines()
  lines = [l for l in lines if l.strip()]  # Remove empty lines
  max_w = max(wcswidth(l) for l in lines)

  top_pad = max(0, (rows - len(lines)) // 2)
  bottom_pad = max(0, rows - len(lines) - top_pad)
  left_pad = max(0, (cols - max_w) // 2)
  
  print("\n" * top_pad, end="")

  for l in lines:
      print(" " * left_pad + l)
  print("\n" * bottom_pad, end="")
  '';
}